# ==============================================================================
# HOMEBREW BREWFILE - ORGANIZED BY CATEGORIES
# ==============================================================================

# ==============================================================================
# TAPS
# ==============================================================================
tap "buo/cask-upgrade"
tap "nikitabobko/tap"

# ==============================================================================
# SYSTEM UTILITIES & MONITORING
# ==============================================================================
brew "btop"
brew "htop"
brew "zenith"
brew "fastfetch"
brew "dust"
brew "duf"

# ==============================================================================
# SHELL & TERMINAL TOOLS
# ==============================================================================
brew "zsh"
brew "atuin"
brew "zoxide"
brew "tealdeer"

# ==============================================================================
# FILE MANAGEMENT & NAVIGATION
# ==============================================================================
brew "eza"
brew "yazi"
brew "stow"

# ==============================================================================
# TEXT PROCESSING & VIEWERS
# ==============================================================================
brew "bat"
brew "glow"
brew "chroma"
brew "jq"

# ==============================================================================
# TEXT EDITORS
# ==============================================================================
brew "neovim"
brew "evil-helix"

# ==============================================================================
# DEVELOPMENT TOOLS
# ==============================================================================
brew "go"
brew "gh"
brew "git-delta"
brew "tokei"
brew "onefetch"
brew "uv"

# ==============================================================================
# DEVOPS & CLOUD TOOLS
# ==============================================================================
brew "helm"
brew "kubectl"

# ==============================================================================
# NETWORK & DOWNLOAD TOOLS
# ==============================================================================
brew "wget"

# ==============================================================================
# SYSTEM LIBRARIES
# ==============================================================================
brew "xz"
brew "poppler"
brew "graphviz"

# ==============================================================================
# TERMINALS
# ==============================================================================
cask "ghostty"
cask "iterm2"

# ==============================================================================
# BROWSERS
# ==============================================================================
cask "arc"
cask "brave-browser"

# ==============================================================================
# DEVELOPMENT APPLICATIONS
# ==============================================================================
cask "visual-studio-code"
cask "bruno"
cask "drawio"

# ==============================================================================
# PRODUCTIVITY & OFFICE
# ==============================================================================
cask "obsidian"
cask "raycast"
cask "maccy"

# ==============================================================================
# WINDOW MANAGEMENT & SYSTEM UTILITIES
# ==============================================================================
cask "aerospace"
cask "rectangle"
cask "jordanbaird-ice"
cask "appcleaner"
cask "command-x"

# ==============================================================================
# MEDIA & GRAPHICS
# ==============================================================================
cask "vlc"
cask "obs"
cask "shotcut"

# ==============================================================================
# FILE MANAGEMENT & CLOUD
# ==============================================================================
cask "cyberduck"
cask "google-drive"
cask "the-unarchiver"

# ==============================================================================
# FONTS
# ==============================================================================
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"

# ==============================================================================
# SYSTEM CUSTOMIZATION
# ==============================================================================
cask "eurkey"

# ==============================================================================
# COMMUNICATION
# ==============================================================================
cask "whatsapp@beta"

# ==============================================================================
# WINDOW SWITCHER
# ==============================================================================
brew "alt-tab"
