tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "nikitabobko/tap"
brew "xz"
brew "atuin"
brew "glow"
brew "bat"
brew "btop"
brew "chroma"
brew "duf"
brew "eza"
brew "onefetch"
brew "helm"
brew "kubectl"
brew "fastfetch"
brew "gh"
brew "graphviz"
brew "htop"
brew "neovim"
brew "node"
brew "pyenv"
brew "rye"
brew "stow"
brew "tealdeer"
brew "wget"
brew "yazi"
brew "zenith"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
cask "aerospace"
cask "appcleaner"
cask "arc"
cask "bartender"
cask "brave-browser"
cask "bruno"
cask "command-x"
cask "cursor"
cask "cyberduck"
cask "eurkey"
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "google-cloud-sdk"
cask "google-drive"
cask "iterm2"
cask "jordanbaird-ice"
cask "kitty"
cask "lm-studio"
cask "maccy"
cask "poe"
cask "raycast"
cask "rectangle"
cask "shotcut"
cask "the-unarchiver"
cask "visual-studio-code"
cask "whatsapp@beta"
