tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "xz"
brew "atuin"
brew "bat"
brew "docker"
brew "duf"
brew "eza"
brew "gh"
brew "graphviz"
brew "neovim"
brew "pyenv"
brew "tealdeer"
brew "zenith"
brew "zoxide"
brew "zsh"
cask "appcleaner"
cask "brave-browser"
cask "cyberduck"
cask "eurkey"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "google-drive"
cask "iterm2"
cask "joplin"
cask "raycast"
cask "rectangle"
cask "shotcut"
cask "the-unarchiver"
cask "visual-studio-code"
cask "whatsapp"
vscode "aaron-bond.better-comments"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bungcip.better-toml"
vscode "charliermarsh.ruff"
vscode "clemenspeters.format-json"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "doggy8088.quicktype-refresh"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "executablebookproject.myst-highlight"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "janisdd.vscode-edit-csv"
vscode "khaeransori.json2csv"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mechatroner.rainbow-csv"
vscode "michelemelluso.gitignore"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "nextfaze.json-parse-stringify"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "penumbratheme.penumbra"
vscode "phplasma.csv-to-table"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "searking.preview-vscode"
vscode "sonarsource.sonarlint-vscode"
vscode "sourcery.sourcery"
vscode "stuart.unique-window-colors"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
